app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" WHERE (payload -> 'result' ->> 'radiant_team_id' = '1838315')
---
	def index
		@matches_rad = Match.where("payload -> 'result' ->> 'radiant_team_id' = '1838315'")