app/controllers/players_controller.rb

  def show
    @player = Player.find_by("account_id = #{params[:id]}")
---
SELECT  "players".* FROM "players" WHERE (account_id = 86745912) LIMIT 1