app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE (top_50 = true)
---
	def index
    @teams = Team.where("rank <= 25").order(rank: :asc)
		team_ids = []
		@teams.each do |team|

SELECT "players".* FROM "players"
---
			@pick_list << pick_counts.sort_by{|k, v| -v}
			@ban_list << ban_counts.sort_by{|k, v| -v}
		end
		@players = Player.all